DV_Cisco_TMS/ConfRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <ContextHeader xmlns="http://tandberg.net/2004/02/tms/external/booking/">
      <SendConfirmationMail>true</SendConfirmationMail>
      <ExcludeConferenceInformation>false</ExcludeConferenceInformation>
      <ClientLanguage>en</ClientLanguage>
    </ContextHeader>
    <ExternalAPIVersionSoapHeader xmlns="http://tandberg.net/2004/02/tms/external/booking/">
      <ClientVersionIn>15</ClientVersionIn>
      <ClientIdentifierIn>string</ClientIdentifierIn>
      <ClientLatestNamespaceIn>String</ClientLatestNamespaceIn>
      <NewServiceURL>string</NewServiceURL>
      <ClientSession>0</ClientSession>
    </ExternalAPIVersionSoapHeader>
  </soap12:Header>
  <soap12:Body>
    <SaveConference xmlns="http://tandberg.net/2004/02/tms/external/booking/">
      <Conference>
        <ConferenceID />
        <Title>TESTBOKNING</Title>
        <StartTimeUTC>2021-05-01 11:00:00Z</StartTimeUTC>
        <EndTimeUTC>2021-05-01 12:00:00Z</EndTimeUTC>
        <OwnerId />
        <OwnerUserName />
        <OwnerFirstName />
        <OwnerLastName />
        <OwnerEmailAddress />
        <ConferenceType />
        <Bandwidth />
        <PictureMode />
        <Encrypted />
        <DataConference />
        <ShowExtendOption />
        <Password />
        <ISDNRestrict />
        <Participants>
          <Participant>
            <NameOrNumber>Deltagare1</NameOrNumber>
            <ParticipantCallType>IP Video -&gt;</ParticipantCallType>
          </Participant>
          <Participant>
            <NameOrNumber>Deltagare2</NameOrNumber>
            <ParticipantCallType>IP Video -&gt;</ParticipantCallType>
          </Participant>
          <Participant>
            <NameOrNumber>Deltagare3</NameOrNumber>
            <ParticipantCallType>IP Video -&gt;</ParticipantCallType>
          </Participant>
        </Participants>
      </Conference>
    </SaveConference>
  </soap12:Body>
</soap12:Envelope>